app/Http/Controllers/QuestionController.php

    public function index()
    {
        $questions = Question::with(['user'])->latest()->paginate(5);
---
select * from `users` where `users`.`id` in (2, 3, 4)
select * from `questions` order by `created_at` desc limit 5 offset 5
select count(*) as aggregate from `questions`